**Pandas Introduction**

In [1]:
import pandas as pd

In [2]:
print(pd.__version__)

2.3.2

**Pandas has two types of data structures**
1-Series (1 dimensional)
2-Dataframe (2 dimensional)

In [3]:
s = pd.Series([10,2,3,4,5])

In [4]:
s

0    10
1     2
2     3
3     4
4     5
dtype: int64

**Series is a labeled array & list is an unlabeled array**

*Here 0,1,2,3,4 are indexes and the other are their corresponding values*

In [5]:
s1 = pd.Series([10,2,3,4,5],index=['a','b','v','f','g'])

In [6]:
s1

a    10
b     2
v     3
f     4
g     5
dtype: int64

In [7]:
df = pd.DataFrame({"names":["raza","hassan","ali"],"marks":[100,300,400]})

In [8]:
df

    names  marks
0    raza    100
1  hassan    300
2     ali    400

In [9]:
df1 = pd.read_csv("industry.csv")

In [10]:
df1

                         Industry  code
0              Accounting/Finance    12
1    Advertising/Public Relations    13
2              Aerospace/Aviation    14
3   Arts/Entertainment/Publishing    15
4                      Automotive    16
5                Banking/Mortgage    17
6            Business Development    18
7            Business Opportunity    19
8         Clerical/Administrative    20
9         Construction/Facilities    21
10                 Consumer Goods    22
11               Customer Service    23
12             Education/Training    24
13               Energy/Utilities    25
14                    Engineering    26
15            Government/Military    27
16                          Green    28
17                     Healthcare    29
18             Hospitality/Travel    30
19                Human Resources    31
20       Installation/Maintenance    32
21                      Insurance    33
22                       Internet    34
23                Job Search Aids    35
24       Law Enforcement/Security    36
25                          Legal    37
26           Management/Executive    38
27       Manufacturing/Operations    39
28                      Marketing    40
29           Non-Profit/Volunteer    41
30         Pharmaceutical/Biotech    42
31          Professional Services    43
32             QA/Quality Control    44
33                    Real Estate    45
34        Restaurant/Food Service    46
35                         Retail    47
36                          Sales    48
37               Science/Research    49
38                  Skilled Labor    50
39                     Technology    51
40             Telecommunications    52
41       Transportation/Logistics    53
42                          Other    54

In [11]:
df1.head()

                        Industry  code
0             Accounting/Finance    12
1   Advertising/Public Relations    13
2             Aerospace/Aviation    14
3  Arts/Entertainment/Publishing    15
4                     Automotive    16

In [12]:
df1.tail()

                    Industry  code
38             Skilled Labor    50
39                Technology    51
40        Telecommunications    52
41  Transportation/Logistics    53
42                     Other    54

In [13]:
df1.describe()

            code
count  43.000000
mean   33.000000
std    12.556539
min    12.000000
25%    22.500000
50%    33.000000
75%    43.500000
max    54.000000

In [14]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43 entries, 0 to 42
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Industry  43 non-null     object
 1   code      43 non-null     int64
dtypes: int64(1), object(1)
memory usage: 820.0+ bytes

**Data Selection**

In [15]:
type(df1["code"])

pandas.core.series.Series

In [16]:
df1["code"]

0     12
1     13
2     14
3     15
4     16
5     17
6     18
7     19
8     20
9     21
10    22
11    23
12    24
13    25
14    26
15    27
16    28
17    29
18    30
19    31
20    32
21    33
22    34
23    35
24    36
25    37
26    38
27    39
28    40
29    41
30    42
31    43
32    44
33    45
34    46
35    47
36    48
37    49
38    50
39    51
40    52
41    53
42    54
Name: code, dtype: int64

**this show the first row**

In [18]:
df1.iloc[0]

Industry    Accounting/Finance
code                        12
Name: 0, dtype: object